import echartOptions from './options.js'
import { axisLabelColor, axisSplitLineColor } from './options.js'
import { getBlockLimit, getMonthMap, getRouterParamsByDomainInfo } from './tool'
import _ from 'lodash'

const groupId = '515445641576227' // 集团ID

const queryParams = {
  serviceId: 'S_BE_DM_02',
  modelId: 'DEVICE_STATS',
  apiName: '',
  offset: 0,
  params: {},
  userId: '',
  __blocks__: {
    result: {
      attr: {
        limit: '10',
        offset: '0',
        showCount: 'true',
      },
    },
  },
}

const oppdcCommonParams = {
  shareServiceId: 'S_DC_0103',
  resProjectEname: 'IEHMOPP',
  resAppEname: 'oppdc',
}

const apiSBEDM02 = 'eplat/service/S_BE_DM_02' // 微服务
const apiSBEAS03 = 'eplat/service/S_BE_AS_03' // 共享服务

// 不允许通过的基地
const notAllowBase = ['39873366667377', '317724498412849', '402814206566170']
// 允许通过的厂区
const allowFactoryIds = [
  '408348049827378', // 马钢 四钢轧
  '441050750917380', // 马钢 冷轧
  '441050750917903', // 马钢 炼铁
  '155750521841079', // 八钢 炼铁厂
  '193216202194409', // 八钢 轧钢厂
  '195301400926094', // 八钢 炼钢厂
  '229807805227484', // 八钢 能源中心
  '404014338858701', // 韶钢 特轧厂
  '429934158948704', // 鄂钢 焦化
  '429934158948705', // 鄂钢 烧结
  '429934158948706', // 鄂钢 炼铁
  '429934158948708', // 鄂钢 宽板
  '429934158948709', // 鄂钢 能动
  '429934158948710', // 鄂钢 制氧
  '456200434597555', // 鄂钢 轧材
  '429934158948707', // 鄂钢 炼钢
  '192657717590895', // 宝山 宝日汽车板
  '240958284261879', // 宝山 厚板厂
  '405827723900011', // 宝山 电厂
  '55065950380088', // 宝山 冷轧
  '560527541336083', // 宝山 炼钢厂
  '55065950380087', // 宝山 炼铁厂
  '515445641576272', // 宝山 热轧厂
  '447342516018991', // 武钢 SCP条材厂
  '484372562929926', // 武钢 热轧
  '345587486005802', // 湛钢 厚板厂
  '345587486005804', // 湛钢 冷轧厂
  '345587486005801', // 湛钢 热轧厂
  '345587486005798', // 湛钢 炼铁厂
  '345587486005799', // 湛钢 炼钢厂
  '345587486005783', // 湛钢 物流部
  '362064794075551', // 湛钢 设备管理部
  '362064794075557', // 湛钢 资材备件采购部
  '345587486005803', // 湛钢 能源环保部
  '503029839637400', // 德胜 冷轧厂
  '232315205854848', // 宝武碳业 宝山基地
  '232315205854864', // 宝武碳业 湛江基地
  '426483584347386', // 重庆钢铁 炼铁厂
  '426483584347615', // 重庆钢铁 炼钢厂
  '426483584347616', // 重庆钢铁 轧钢厂
  '426483584347617', // 重庆钢铁 能环部
  '426483584347618', // 重庆钢铁 物流运输部
  '368238835416388', // 梅山钢铁 能环部
  '368238835416353', // 梅山钢铁 炼铁厂
  '368238835416403', // 梅山钢铁 热轧厂
  '368238835416316', // 梅山钢铁 冷轧厂
  '368238835416302', // 梅山钢铁 电厂
  '368238835416322', // 梅山钢铁 炼钢厂
  '368238835416431', // 梅山钢铁 运输部
  '377985141957623', // 宝武清能 宝山气体
  '377985141991619', // 宝武清能 上海宝氢
  '377985141991622', // 宝武清能 宝锐特
  '377985141991625', // 宝武清能 鄂州气体
  '377985141991628', // 宝武清能 湛江气体
  '377985141991642', // 宝武清能 武钢气体
  '377985141991664', // 宝武清能 朝阳气体
  '374189195226070', // 马钢基地轨交材料 马钢交材
]
// 允许通过的产线
const allowProdLineIds = [
  '367977251984538', // 宝山 宝日汽车板 宝日汽车板产线  --  √
  '240958284261882', // 宝山 厚板厂 粗轧  --  √
  '23466399888721', // 宝山 厚板厂 5m厚板  --  √
  '367977251984482', // 宝山 厚板厂 厚板厂产线  --  √
  '121350911688302', // 宝山 电厂 电厂电气室  --  √
  '406004089010000', // 宝山 电厂 1号发电单元  --  √
  '443062706339945', // 宝山 电厂 3号发电单元  --  √
  '336028220090002', // 宝山 冷轧厂 2030产线  --  √
  '514834283978789', // 宝山 冷轧厂 1550产线  --  √
  '367977251980185', // 宝山 冷轧厂 1550产线  --  √
  '373448775760010', // 宝山 炼钢厂 二炼钢  --  √
  '373448775760008', // 宝山 炼钢厂 一炼钢  --  √
  '196710435927970', // 宝山 炼钢厂 炼钢电气室  --  √
  '196189326849396', // 宝山 炼铁厂 四高炉  --  √
  '406986939660001', // 宝山 炼铁厂 三高炉  --  √
  '406986939660000', // 宝山 炼铁厂 四烧结  --  √
  '118829925198723', // 宝山 炼铁厂 三烧结  --  √
  '196189326849050', // 宝山 炼铁厂 二烧结  --  √
  '272643031788914', // 宝山 炼铁厂 一焦炉  --  √
  '220623534941046', // 宝山 炼铁厂 三焦炉  --  √
  '220623534941047', // 宝山 炼铁厂 四焦炉  --  √
  '367977251990210', // 宝山 炼铁厂 煤精分厂  --  √
  '367977251980209', // 宝山 炼铁厂 铁焦单元  --  √
  '128431915140238', // 宝山 炼铁厂 炼铁电气室  --  √
  '367977251980175', // 宝山 炼铁厂 原烧单元  --  √
  '17668112050001', // 宝山 热轧厂 1880产线  --  √
  '213735250971905', // 宝山 热轧厂 精整  --  √
  '554925002946064', // 宝山 热轧厂 2050  --  √
  '524031514586065', // 宝山 热轧厂 1580  --  √

  // "229807805227691",  // 八钢 能源中心 热力分厂 --  √
  // "229807805227490",  // 八钢 能源中心 制氧分厂 --  √
  // "155750521841080",  // 八钢 炼铁厂 焦化分厂 √
  // "193216202194412",  // 八钢 炼铁厂 第一炼铁分厂 X
  // "193216202194414",  // 八钢 炼铁厂 富氧循环高炉 X
  // "195301400934289",  // 八钢 炼铁厂 二炼铁分厂   X
  // "195301400934291",  // 八钢 炼铁厂 原料分厂     X
  // "195301400934293",  // 八钢 炼铁厂 富氢循环高炉 X
  // "195301400934295",  // 八钢 轧钢厂 中厚板分厂   X
  // "195301400934297",  // 八钢 轧钢厂 棒线分厂     X
  // "195301400926095",  // 八钢 炼钢厂 二炼钢分厂   X
  // "195301400926097",  // 八钢 炼钢厂 一炼钢分厂   X

  '408302691957451', // 马钢 四钢轧 2250产线  --  √
  '521681702957377', // 马钢 四钢轧 1580产线  --  √
  '441050750917381', // 马钢 冷轧   1720产线  --  √
  '449785436038777', // 马钢 冷轧   2130产线  --  √
  '441050750917904', // 马钢 炼铁   炼铁南区  --  √

  '429934158948715', // 鄂钢 焦化 焦化东区  --  √
  '429934158948717', // 鄂钢 焦化 焦化西区  --  √
  '429934158948722', // 鄂钢 烧结 烧结区  --  √
  '429934158948725', // 鄂钢 宽板 宽板区  --  √
  '429934158948723', // 鄂钢 炼铁 一高炉区  --  √
  '429934158948731', // 鄂钢 炼铁 二高炉区  --  √
  '429934158948728', // 鄂钢 能动 能动区  --  √
  '429934158948727', // 鄂钢 制氧 制氧新区  --  √
  '429934158948724', // 鄂钢 炼钢 炼钢区  --  √
  '456200434597556', // 鄂钢 轧材 高线  --  √
  '456200434597886', // 鄂钢 轧材 棒三  --  √

  '484372562929928', // 武钢 热轧厂 2250产线  --√
  '487173393169295', // 武钢 条材厂 csp  --√

  '404014338858702', // 韶钢 特轧厂 高一线 -- √
  '404014338859262', // 韶钢 特轧厂 高二线 -- √
  '404014338859276', // 韶钢 特轧厂 高三线 -- √
  '404014338859277', // 韶钢 特轧厂 棒一线 -- √
  '188786195769339', // 韶钢 特轧厂 棒二线 -- √
  '404014338859278', // 韶钢 特轧厂 棒三线 -- √
  '404014338859279', // 韶钢 特轧厂 特棒厂 -- √
  '404014338859280', // 韶钢 特轧厂 板材厂 -- √

  '345587486019861', // 湛钢 厚板厂 4200产线 -- √
  '358947652733431', // 湛钢 冷轧厂 2030冷轧 -- √
  '358947652733430', // 湛钢 冷轧厂 1550冷轧 -- √
  '358947652733432', // 湛钢 冷轧厂 1750冷轧 -- √
  '354880206749584', // 湛钢 热轧厂 2250热轧 -- √
  '349666421642938', // 湛钢 炼铁厂 原料 -- √
  '349666421642940', // 湛钢 炼铁厂 1#烧结 -- √
  '349666421642941', // 湛钢 炼铁厂 2#烧结 -- √
  '349666421642944', // 湛钢 炼铁厂 球团 -- √
  '349666421642939', // 湛钢 炼铁厂 炼焦 -- √
  '349666421642942', // 湛钢 炼铁厂 1#高炉 -- √
  '349666421642943', // 湛钢 炼铁厂 2#高炉 -- √
  '353560971686867', // 湛钢 炼钢厂 炼钢 -- √
  '353560971686869', // 湛钢 炼钢厂 焙烧 -- √
  '353560971686870', // 湛钢 炼钢厂 2150连铸 -- √
  '353560971686872', // 湛钢 炼钢厂 2300连铸 -- √
  '362064794075552', // 湛钢 设备管理部 设备部 -- √
  '362064794075558', // 湛钢 资材备件采购部 资材备件采购部设备 -- √

  '507799579337411', // 德胜 热轧厂 1600酸洗线
  '518501813477412', // 德胜 热轧厂 DRAPL
  '503029839637401', // 德胜 热轧厂 HRAPL
  '47998246746289', // 德胜 热轧厂 精整1#-4#线

  '232315205854852', // 宝武碳业 宝山基地 化产
  '232315205854849', // 宝武碳业 宝山基地 煤精
  '232315205854865', // 宝武碳业 湛江基地 化产

  // "392402776970343",  //  重庆钢铁 炼铁厂 运转
  // "426483584347387",  //  重庆钢铁 炼铁厂 一烧结
  // "426483584347391",  //  重庆钢铁 炼铁厂 一高炉
  // "397907815575281",  //  重庆钢铁 炼铁厂 焦化
  // "426483584347393",  //  重庆钢铁 炼铁厂 三高炉
  // "426483584347390",  //  重庆钢铁 炼铁厂 烧结
  // "426483584347389",  //  重庆钢铁 炼铁厂 三烧结
  // "426483584347392",  //  重庆钢铁 炼铁厂 二高炉
  // "392402776970342",  //  重庆钢铁 炼铁厂 原加
  // "426483584347395",  //  重庆钢铁 炼铁厂 二烧结
  // "397907815575287",  //  重庆钢铁 炼铁厂 喷煤
  // "426483584347394",  //  重庆钢铁 炼铁厂 高炉
  // "426483584496997",  //  重庆钢铁 炼钢厂 公辅
  // "426483584486020",  //  重庆钢铁 炼钢厂 一炼钢
  // "390214213146514",  //  重庆钢铁 轧钢厂 厚板线
  // "390214213146516",  //  重庆钢铁 轧钢厂 中板线
  // "390214213146497",  //  重庆钢铁 轧钢厂 热卷产线
  // "390214213146520",  //  重庆钢铁 能环部 发电厂
  // "427064124041256",  //  重庆钢铁 能环部 风机
  // "427064124123455",  //  重庆钢铁 能环部 空压站
  // "427064124146028",  //  重庆钢铁 能环部 余热
  // "427064124143094",  //  重庆钢铁 能环部 煤气柜
  // "390214213620438",  //  重庆钢铁 物流运输部 料场作业区
  // "392402776910032",  //  重庆钢铁 物流运输部 铁路作业区
  // "392402776910034",  //  重庆钢铁 物流运输部 码头作业区

  // "368238837381461",  // 梅山钢铁 能环部 煤精单元
  // "368238835416391",  // 梅山钢铁 能环部 煤气系统
  // "368238835416389",  // 梅山钢铁 能环部 连铸单元
  // "368238837381449",  // 梅山钢铁 能环部 供电系统
  // "368238835416397",  // 梅山钢铁 能环部 新建设项目动力系统
  // "368238837381466",  // 梅山钢铁 能环部 新建设项目供电系
  // "368238835416356",  // 梅山钢铁 炼铁厂 新建设项目动力系统
  // "368238839285396",  // 梅山钢铁 炼铁厂 新烧结单元
  // "368238837185927",  // 梅山钢铁 炼铁厂 煤精单元
  // "368238835416375",  // 梅山钢铁 炼铁厂 新炼铁单元
  // "368238837185944",  // 梅山钢铁 炼铁厂 烧结单元
  // "368238837185973",  // 梅山钢铁 炼铁厂 原料单
  // "368238835416404",  // 梅山钢铁 热轧厂 二热轧单
  // "368238835416317",  // 梅山钢铁 冷轧厂 1420冷轧单
  // "368238835416303",  // 梅山钢铁 电厂 电厂单
  // "368238835416325",  // 梅山钢铁 炼钢厂 二炼钢单
  // "368238835416435",  // 梅山钢铁 运输部 铁路运输单元
  // "368238835416432",  // 梅山钢铁 运输部 码头单元

  // "377985142014732",  // 宝武清能 宝山气体 二区
  // "377985142014688",  // 宝武清能 宝山气体 一区
  // "377985141991620",  // 宝武清能 上海宝氢 示例产线
  // "377985141991623",  // 宝武清能 宝锐特 示例产线1
  // "377985141991626",  // 宝武清能 鄂州气体 制氧新区
  // "377985141991637",  // 宝武清能 湛江气体 二期
  // "377985141991629",  // 宝武清能 湛江气体 一期
  // "377985141991662",  // 宝武清能 武钢气体 空压站单元
  // "377985141991643",  // 宝武清能 武钢气体 制氧单元
  // "377985141991658",  // 宝武清能 武钢气体 特气单元
  // "377985141991665",  // 宝武清能 朝阳气体 建桥基地
  // "377985141991667",  // 宝武清能 朝阳气体 长寿基地

  // "374189195226071",  // 马钢基地轨交材料 马钢交材 高低压供配电
  // "374189195574156",  // 马钢基地轨交材料 马钢交材 车轮原坯加热
  // "386437878544936",  // 马钢基地轨交材料 马钢交材 RQQ上料机械手
  // "374189195226090",  // 马钢基地轨交材料 马钢交材 车轮精加工线
  // "386437878544984",  // 马钢基地轨交材料 马钢交材 原料库
  // "386437878544977",  // 马钢基地轨交材料 马钢交材 5#检测线
  // "386437878544995",  // 马钢基地轨交材料 马钢交材 半成品立库
  // "374189195574158",  // 马钢基地轨交材料 马钢交材 原料切锭线
  // "386437878544968",  // 马钢基地轨交材料 马钢交材 4#检测线
  // "374189195574162",  // 马钢基地轨交材料 马钢交材 轧制三线
  // "386437878544990",  // 马钢基地轨交材料 马钢交材 缓冷库
  // "374189195574153",  // 马钢基地轨交材料 马钢交材 2号热处理线
]

// 登录对接安全中心地址  https://eplattest.baoiem.com/oppws/     http://localhost:8800/
// "https://eplattest.baoiem.com/eplat/oauth/authorize?client_id=iehmoppws&response_type=code&redirect_uri=http://localhost:8800/&scope=write";
const localCallbackUrl = 'https://eplattest.baoiem.com/oppws/'
const testCallbackUrl = 'https://eplattest.baoiem.com/oppws/'
const prodCallbackUrl = 'https://eplat.baoiem.com/oppws/'

const localRedirectUrl =
  'https://eplattest.baoiem.com/eplat/oauth/authorize?client_id=iehmoppws&response_type=code&redirect_uri=http://localhost:8800/&scope=write'
const testRedirectUrl =
  'https://eplattest.baoiem.com/eplat/oauth/authorize?client_id=iehmoppws&response_type=code&redirect_uri=https://eplattest.baoiem.com/oppws/&scope=write'
const prodRedirectUrl =
  'https://eplat.baoiem.com/eplat/oauth/authorize?client_id=iehmoppws&response_type=code&redirect_uri=https://eplat.baoiem.com/oppws/&scope=write'

const interval = 1 * 60 * 60 * 1000

// 设备运行日报，不同基地的参数配置
const dailyOptions = {
  408348049827377: {
    // 马钢
    shareServiceId: 'S_MA_SM_0001',
    projectEname: 'IEHMPMS',
  },
  404014338858700: {
    // 韶钢
    shareServiceId: 'S_MA_SM_0101',
    projectEname: 'SGIEHMPMS',
  },
  503029839637399: {
    // 德盛
    shareServiceId: 'S_MA_SM_0201',
    projectEname: 'DSIEHMPMS',
  },
}

// 故障时间，不同基地的参数配置
const failureTimeOptions = {
  408348049827377: {
    // 马钢
    shareServiceId: 'S_MA_SM_0002',
    projectEname: 'IEHMPMS',
  },
  404014338858700: {
    // 韶钢
    shareServiceId: 'S_MA_SM_0102',
    projectEname: 'SGIEHMPMS',
  },
  503029839637399: {
    // 德盛
    shareServiceId: 'S_MA_SM_0202',
    projectEname: 'DSIEHMPMS',
  },
}

// 故障次数，不同基地的参数配置
const failureCountOptions = {
  408348049827377: {
    // 马钢
    shareServiceId: 'S_MA_SM_0003',
    projectEname: 'IEHMPMS',
  },
  404014338858700: {
    // 韶钢
    shareServiceId: 'S_MA_SM_0103',
    projectEname: 'SGIEHMPMS',
  },
  503029839637399: {
    // 德盛
    shareServiceId: 'S_MA_SM_0203',
    projectEname: 'DSIEHMPMS',
  },
}

/** 输出常量 */
export let globalData = _.cloneDeep(
  Object.assign(
    {
      queryParams,
      oppdcCommonParams,
      apiSBEDM02,
      apiSBEAS03,
      groupId,
      axisLabelColor,
      axisSplitLineColor,
      interval,
      echartOptions,
      notAllowBase,
      allowFactoryIds,
      allowProdLineIds,
      localCallbackUrl,
      testCallbackUrl,
      prodCallbackUrl,
      localRedirectUrl,
      testRedirectUrl,
      prodRedirectUrl,
      dailyOptions,
      failureTimeOptions,
      failureCountOptions,
      getBlockLimit,
      getMonthMap,
      getRouterParamsByDomainInfo,
    },
    echartOptions
  )
)

export default {
  install(Vue) {
    Object.keys(globalData).forEach((constName) => {
      Vue.prototype[`$${constName}`] = globalData[constName]
    })
  },
}
