<template>
  <div class="d-flex jc-center ai-center h-100" id="base-main-map-content">
    <div
      id="baseImg"
      :style="{
        backgroundImage: 'url(' + (coverImgUrl ? coverImgUrl : null) + ')',
      }"
    >
      <div class="itemsImg">
        <div v-for="(item, key) in InfoList" :key="key" class="d-flex ai-center sub-base-img-container" :style="subImgStyle(item)">
          <div class="sub-base-img" @click="switchNode(item)"></div>
          <span :class="domainNameClass">{{ item['DOMAIN_NAME'] }}</span>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
// import { getDomainChildrens } from './utils/domainApi'
import { getNextLevelNodes } from '@/api/bigscreen'
// import subDomainListData from './json/subDomainListData.json'
import { mapState, mapMutations } from 'vuex'
import { setCurrentNodeId, getCurrentNodeId, setCurrentNodeLevel, getCurrentNodeLevel } from '@/utils/auth'
export default {
  data() {
    return {
      // baseImg: require('../../../assets/image/map.png'),
      coverImgUrl: '',
      imgContainerLoaded: false,
      subDomainList: [],
      axisList: {
        408877815: [0.5, 0.5],
        55065950380087: [0.36, 0.3], // 上海宝山 炼铁厂 --
        55065950380088: [0.3, 0.71], // 上海宝山 冷轧厂 --
        23466399888720: [0.3, 0.35], // 上海宝山 镀锡板厂 --
        515445641576272: [0.57, 0.44], // 上海宝山 热轧厂 --
        560527541336083: [0.44, 0.47], // 上海宝山 炼钢厂 --
        405827723900011: [0.44, 0.19], // 上海宝山 电厂 --
        192657717590895: [0.68, 0.56], // 上海宝山 宝日汽车板公司  --
        240958284261879: [0.53, 0.6], // 上海宝山 厚板厂  --
        367977251984538: [0.7, 0.54], // 上海宝山 宝日汽车板 宝日汽车板产线  --  √
        240958284261882: [0.6, 0.74], // 上海宝山 厚板厂 粗轧  --  √
        23466399888721: [0.57, 0.68], // 上海宝山 厚板厂 5m厚板  --  √
        367977251984482: [0.53, 0.63], // 上海宝山 厚板厂 厚板厂产线  --  √
        121350911688302: [0.48, 0.18], // 上海宝山 电厂 电厂电气室  --  √
        406004089010000: [0.46, 0.32], // 上海宝山 电厂 1号发电单元  --  √
        443062706339945: [0.65, 0.23], // 上海宝山 电厂 3号发电单元  --  √
        336028220090002: [0.6, 0.23], // 上海宝山 冷轧厂 2030产线  --  √
        514834283978789: [0.5, 0.73], // 上海宝山 冷轧厂 1550产线  --  √
        367977251980185: [0.3, 0.48], // 上海宝山 冷轧厂 1550产线  --  √
        373448775760010: [0.17, 0.55], // 上海宝山 炼钢厂 二炼钢  --  √
        373448775760008: [0.42, 0.45], // 上海宝山 炼钢厂 一炼钢  --  √
        196710435927970: [0.25, 0.51], // 上海宝山 炼钢厂 炼钢电气室  --  √
        196189326849396: [0.57, 0.65], // 上海宝山 炼铁厂 四高炉  --  √
        406986939660001: [0.62, 0.54], // 上海宝山 炼铁厂 三高炉  --  √
        406986939660000: [0.38, 0.68], // 上海宝山 炼铁厂 四烧结  --  √
        118829925198723: [0.33, 0.63], // 上海宝山 炼铁厂 三烧结  --  √
        196189326849050: [0.28, 0.58], // 上海宝山 炼铁厂 二烧结  --  √
        272643031788914: [0.35, 0.5], // 上海宝山 炼铁厂 一焦炉  --  √
        220623534941046: [0.35, 0.4], // 上海宝山 炼铁厂 三焦炉  --  √
        220623534941047: [0.15, 0.35], // 上海宝山 炼铁厂 四焦炉  --  √
        367977251990210: [0.2, 0.55], // 上海宝山 炼铁厂 煤精分厂  --  √
        367977251980209: [0.2, 0.45], // 上海宝山 炼铁厂 铁焦单元  --  √
        128431915140238: [0.2, 0.38], // 上海宝山 炼铁厂 炼铁电气室  --  √
        367977251980175: [0.22, 0.35], // 上海宝山 炼铁厂 原烧单元  --  √
        17668112050001: [0.22, 0.55], // 上海宝山 热轧厂 1880产线  --  √
        213735250971905: [0.28, 0.45], // 上海宝山 热轧厂 精整  --  √
        554925002946064: [0.62, 0.35], // 上海宝山 热轧厂 2050  --  √
        524031514586065: [0.25, 0.4], // 上海宝山 热轧厂 1580  --  √
        // "378831193229334": [1000, 1000],  // 上海宝山 硅钢部 -- x
        // "51652307842136":  [1000, 1000],  // 上海宝山 钢管条钢事业部  ×
        // "502694490680229": [1000, 1000],  // 上海宝山 能源环保部  ×
        // "406402534240066": [1000, 1000],  // 上海宝山 运输部  ×
        254057388086265: [1000, 1000], // 上海宝山 宝田新型建材 x (暂时不显示)
        // "336028220090000": [1000, 1000],  // 上海宝山 冷轧厂 1420产线  --  ×
        // "77286368902363" : [1000, 1000],  // 上海宝山 冷轧厂 1730产线  --  ×
        // "367977251980178": [1000, 1000],  // 上海宝山 冷轧厂 彩板  --  ×

        232315205854848: [0.78, 0.47], // 宝武碳业 宝山基地
        232315205854852: [0.5, 0.28], // 宝武碳业 宝山基地 化产
        232315205854849: [0.73, 0.53], // 宝武碳业 宝山基地 煤精
        232315205854864: [0.62, 0.69], // 宝武碳业 湛江基地
        232315205854865: [0.5, 0.5], // 宝武碳业 湛江基地 化产

        229807805227484: [0.33, 0.25], // 八钢 能源中心 --
        155750521841079: [0.35, 0.45], // 八钢 炼铁厂 --
        193216202194409: [0.52, 0.22], // 八钢 轧钢厂 --
        195301400926094: [0.5, 0.35], // 八钢 炼钢厂 --
        155750521841080: [0.75, 0.5], // 八钢 炼铁厂 焦化分厂 -- √
        193216202194412: [0.34, 0.45], // 八钢 炼铁厂 第一炼铁分厂 -- √
        193216202194414: [0.61, 0.35], // 八钢 炼铁厂 富氧循环高炉 -- √
        195301400934293: [0.71, 0.4], // 八钢 炼铁厂 富氢循环高炉 -- √
        195301400934289: [0.64, 0.48], // 八钢 炼铁厂 二炼铁分厂 -- √
        195301400934291: [0.8, 0.35], // 八钢 炼铁厂 原料分厂 -- √
        195301400934295: [0.17, 0.45], // 八钢 轧钢厂 中厚板分厂 -- √
        195301400934297: [0.31, 0.32], // 八钢 轧钢厂 棒线分厂 -- √
        195301403038563: [0.51, 0.22], // 八钢 轧钢厂 冷轧分厂 -- √
        195301400926095: [0.5, 0.35], // 八钢 炼钢厂 二炼钢分厂 -- √
        195301400926097: [0.28, 0.35], // 八钢 炼钢厂 一炼钢分厂 -- √
        229807805227691: [0.9, 0.42], // 八钢 能源中心 热力分厂 --  √
        229807805227490: [0.35, 0.65], // 八钢 能源中心 制氧分厂 --  √

        408348049827378: [0.8, 0.7], // 马钢 四钢轧 --
        441050750917380: [0.8, 0.77], // 马钢 冷轧 --
        441050750917903: [0.36, 0.4], // 马钢 炼铁 --
        408302691957451: [0.5, 0.5], // 马钢 四钢轧 2250产线  --  √
        521681702957377: [0.68, 0.26], // 马钢 四钢轧 1580产线  --  √
        441050750917381: [0.53, 0.43], // 马钢 冷轧   1720产线  --  √
        449785436038777: [0.75, 0.78], // 马钢 冷轧   2130产线  --  √
        441050750917904: [0.36, 0.4], // 马钢 炼铁   炼铁南区  --  √

        429934158948705: [0.45, 0.71], // 鄂钢 烧结  --
        429934158948709: [0.59, 0.71], // 鄂钢 能动  --
        429934158948708: [0.55, 0.36], // 鄂钢 宽板  --
        429934158948704: [0.37, 0.45], // 鄂钢 焦化  --
        429934158948707: [0.69, 0.27], // 鄂钢 炼钢  --
        429934158948710: [0.21, 0.42], // 鄂钢 制氧  --
        429934158948706: [0.54, 0.6], // 鄂钢 炼铁  --
        456200434597555: [0.63, 0.45], // 鄂钢 轧材  --
        429934158948715: [0.4, 0.45], // 鄂钢 焦化 焦化东区  --  √
        429934158948717: [0.25, 0.55], // 鄂钢 焦化 焦化西区  --  √
        429934158948722: [0.35, 0.45], // 鄂钢 烧结 烧结区  --  √
        429934158948725: [0.45, 0.45], // 鄂钢 宽板 宽板区  --  √
        429934158948723: [0.5, 0.25], // 鄂钢 炼铁 一高炉区  --  √
        429934158948731: [0.57, 0.6], // 鄂钢 炼铁 二高炉区  --  √
        429934158948728: [0.53, 0.3], // 鄂钢 能动 能动区  --  √
        429934158948727: [0.23, 0.7], // 鄂钢 制氧 制氧新区  --  √
        429934158948724: [0.48, 0.4], // 鄂钢 炼钢 炼钢区  --  √
        456200434597556: [0.88, 0.3], // 鄂钢 轧材 高线  --  √
        456200434597886: [0.58, 0.6], // 鄂钢 轧材 棒三  --  √

        31428667306160: [0.65, 0.35], // 武钢 热轧厂 --
        31428667306123: [0.08, 0.21], // 武钢 工业港 --
        31428667306137: [0.57, 0.45], // 武钢 钢电 --
        31428667306145: [0.82, 0.68], // 武钢 硅钢部 --
        31428667306128: [0.15, 0.35], // 武钢 焦化公司 --
        31428667306155: [0.82, 0.48], // 武钢 冷轧厂 --
        31428667306165: [0.47, 0.45], // 武钢 炼钢厂 --
        31428667306133: [0.1, 0.65], // 武钢 炼铁厂 --
        31428667306109: [0.39, 0.49], // 武钢 能源环保部 --
        31428667306140: [0.49, 0.29], // 武钢 气体 --
        31428667306146: [0.29, 0.6], // 武钢 条材厂 --
        31428667306105: [0.34, 0.76], // 武钢 运输部 --
        31428667306116: [0.42, 0.67], // 武钢 制造部 --
        31428667306118: [0.52, 0.76], // 武钢 质检 --

        345587486005802: [0.8, 0.79], // 湛钢 厚板厂  --
        345587486005798: [0.35, 0.71], // 湛钢 炼铁厂  --
        345587486005801: [0.76, 0.66], // 湛钢 热轧厂  --
        345587486005804: [0.8, 0.5], // 湛钢 冷轧厂  --
        345587486005799: [0.6, 0.75], // 湛钢 炼钢厂  --
        345587486005783: [0.63, 0.15], // 湛钢 物流部  --x
        362064794075551: [0.47, 0.78], // 湛钢 设备管理部  --×
        362064794075557: [0.9, 0.43], // 湛钢 资材备件采购部  --×
        345587486005803: [0.47, 0.33], // 湛钢 能源环保部  --x
        345587486019861: [0.5, 0.4], // 湛钢 厚板厂 4200产线 -- √
        358947652733431: [0.6, 0.34], // 湛钢 冷轧厂 2030冷轧 -- √
        358947652733430: [0.68, 0.5], // 湛钢 冷轧厂 1550冷轧 -- √
        358947652733432: [0.68, 0.2], // 湛钢 冷轧厂 1750冷轧 -- √
        354880206749584: [0.5, 0.5], // 湛钢 热轧厂 2250热轧 -- √
        349666421642938: [0.4, 0.3], // 湛钢 炼铁厂 原料 -- √
        349666421642940: [0.3, 0.45], // 湛钢 炼铁厂 1#烧结 -- √
        349666421642941: [0.3, 0.55], // 湛钢 炼铁厂 2#烧结 -- √
        349666421642944: [0.6, 0.48], // 湛钢 炼铁厂 球团 -- √
        349666421642939: [0.3, 0.78], // 湛钢 炼铁厂 炼焦 -- √
        349666421642942: [0.6, 0.78], // 湛钢 炼铁厂 1#高炉 -- √
        349666421642943: [0.7, 0.78], // 湛钢 炼铁厂 2#高炉 -- √
        353560971686867: [0.5, 0.3], // 湛钢 炼钢厂 炼钢 -- √
        353560971686869: [0.5, 0.4], // 湛钢 炼钢厂 焙烧 -- √
        353560971686870: [0.6, 0.3], // 湛钢 炼钢厂 2150连铸 -- √
        353560971686872: [0.6, 0.5], // 湛钢 炼钢厂 2300连铸 -- √
        362064794075552: [0.47, 0.78], // 湛钢 设备管理部 设备部 -- √
        362064794075558: [0.9, 0.43], // 湛钢 资材备件采购部 资材备件采购部设备 -- √

        404014338859270: [0.35, 0.6], // 韶钢 炼铁厂  --
        421026039098834: [0.5, 0.65], // 韶钢 智慧中心  --
        421026039098833: [0.31, 0.49], // 韶钢 能环部  --
        404014338859271: [0.48, 0.45], // 韶钢 炼钢厂  --
        404014338858701: [0.6, 0.37], // 韶钢 特轧厂  --
        404014338858702: [0.52, 0.35], // 韶钢 特轧厂 高一线 -- √
        404014338859262: [0.68, 0.23], // 韶钢 特轧厂 高二线 -- √
        404014338859276: [0.5, 0.73], // 韶钢 特轧厂 高三线 -- √
        404014338859277: [0.5, 0.55], // 韶钢 特轧厂 棒一线 -- √
        188786195769339: [0.43, 0.78], // 韶钢 特轧厂 棒二线 -- √
        404014338859278: [0.5, 0.65], // 韶钢 特轧厂 棒三线 -- √
        404014338859279: [0.75, 0.35], // 韶钢 特轧厂 特棒厂 -- √
        404014338859280: [0.4, 0.55], // 韶钢 特轧厂 板材厂 -- √

        503029839637400: [0.45, 0.72], // 德盛 冷轧厂 -- √
        47998246746251: [0.33, 0.46], // 德盛 炼钢厂 -- √
        47998246746250: [0.42, 0.44], // 德盛 炼铁厂 -- √
        47998246746264: [0.43, 0.62], // 德盛 热轧厂 -- √
        507799579337411: [0.35, 0.62], // 德胜 热轧厂 1600酸洗线
        518501813477412: [0.5, 0.74], // 德胜 热轧厂 DRAPL
        503029839637401: [0.47, 0.68], // 德胜 热轧厂 HRAPL
        47998246746289: [0.38, 0.58], // 德胜 热轧厂 精整1#-4#线

        432846134407756: [0.16, 0.79], // 华菱涟钢 210转炉厂 --
        224286540477393: [0.25, 0.66], // 华菱涟钢 2250热轧板厂 --
        432846134407751: [0.63, 0.5], // 华菱涟钢 棒材厂 --
        432846134407750: [0.5, 0.62], // 华菱涟钢 焦化厂 --
        432846134407757: [0.33, 0.28], // 华菱涟钢 冷轧板厂 --
        432846134407752: [0.7, 0.66], // 华菱涟钢 炼铁厂 --
        432846134407753: [0.8, 0.8], // 华菱涟钢 煤化公司 --
        432846134407755: [0.48, 0.15], // 华菱涟钢 能源总厂 --
        432846134407754: [0.03, 0.65], // 华菱涟钢 热处理板厂 --
        432846134407758: [0.51, 0.43], // 华菱涟钢 一炼轧厂 --

        76490482066220: [0.35, 0.47], // 宁钢基地 热轧厂 --

        162275463658335: [0.6, 0.13], // 太钢 焦化厂 --
        162275463658352: [0.6, 0.4], // 太钢 能源动力厂 --
        162275463658336: [0.55, 0.27], // 太钢 炼铁厂 --
        162275463658337: [0.83, 0.2], // 太钢 炼钢一厂 --
        162275463658353: [0.78, 0.37], // 太钢 加工厂 --
        162275463658351: [0.1, 0.52], // 太钢 冷轧厂 --
        162275463658341: [0.25, 0.65], // 太钢 热连轧 --
        162275463658348: [0.22, 0.45], // 太钢 不锈线材厂 --
        162275463658350: [0.08, 0.33], // 太钢 冷轧硅钢厂 --
        162275463658338: [0.4, 0.5], // 太钢 炼钢二厂 --
        162275463658354: [0.93, 0.1], // 太钢 精密带钢 --
        162275463658340: [0.32, 0.4], // 太钢 型材厂 --
        162275464772742: [0.85, 0.8], // 太钢 太钢天管 --

        108844905480072: [0.75, 0.56], // 太矿 岚县矿业 --
        108844905480075: [0.47, 0.36], // 太矿 采矿部 --
        108844905480078: [0.91, 0.52], // 太矿 能动部 --
        108844905480081: [0.93, 0.75], // 太矿 球团部 --
        108844905480086: [0.42, 0.52], // 太矿 选矿部 --
        108844906558406: [0.12, 0.54], // 太矿 浮选部 --

        // "374189195226070": [0.79, 0.45],  // 马钢基地轨交材料 马钢交材
        // "374189195226071": [0.50, 0.50],  // 马钢基地轨交材料 马钢交材 高低压供配电
        // "374189195574156": [0.50, 0.50],  // 马钢基地轨交材料 马钢交材 车轮原坯加热
        // "386437878544936": [0.50, 0.50],  // 马钢基地轨交材料 马钢交材 RQQ上料机械手
        // "374189195226090": [0.50, 0.50],  // 马钢基地轨交材料 马钢交材 车轮精加工线
        // "386437878544984": [0.50, 0.50],  // 马钢基地轨交材料 马钢交材 原料库
        // "386437878544977": [0.50, 0.50],  // 马钢基地轨交材料 马钢交材 5#检测线
        // "386437878544995": [0.50, 0.50],  // 马钢基地轨交材料 马钢交材 半成品立库
        // "374189195574158": [0.50, 0.50],  // 马钢基地轨交材料 马钢交材 原料切锭线
        // "386437878544968": [0.50, 0.50],  // 马钢基地轨交材料 马钢交材 4#检测线
        // "374189195574162": [0.50, 0.50],  // 马钢基地轨交材料 马钢交材 轧制三线
        // "386437878544990": [0.50, 0.50],  // 马钢基地轨交材料 马钢交材 缓冷库
        // "374189195574153": [0.50, 0.50],  // 马钢基地轨交材料 马钢交材 2号热处理线

        // "368238835416388": [0.50, 0.50],  // 梅山钢铁 能环部
        // "368238837381461": [0.50, 0.50],  // 梅山钢铁 能环部 煤精单元
        // "368238835416391": [0.50, 0.50],  // 梅山钢铁 能环部 煤气系统
        // "368238835416389": [0.50, 0.50],  // 梅山钢铁 能环部 连铸单元
        // "368238837381449": [0.50, 0.50],  // 梅山钢铁 能环部 供电系统
        // "368238835416397": [0.50, 0.50],  // 梅山钢铁 能环部 新建设项目动力系统
        // "368238837381466": [0.50, 0.50],  // 梅山钢铁 能环部 新建设项目供电系
        // "368238835416353": [0.50, 0.50],  // 梅山钢铁 炼铁厂
        // "368238835416356": [0.50, 0.50],  // 梅山钢铁 炼铁厂 新建设项目动力系统
        // "368238839285396": [0.50, 0.50],  // 梅山钢铁 炼铁厂 新烧结单元
        // "368238837185927": [0.50, 0.50],  // 梅山钢铁 炼铁厂 煤精单元
        // "368238835416375": [0.50, 0.50],  // 梅山钢铁 炼铁厂 新炼铁单元
        // "368238837185944": [0.50, 0.50],  // 梅山钢铁 炼铁厂 烧结单元
        // "368238837185973": [0.50, 0.50],  // 梅山钢铁 炼铁厂 原料单
        // "368238835416403": [0.50, 0.50],  // 梅山钢铁 热轧厂
        // "368238835416404": [0.50, 0.50],  // 梅山钢铁 热轧厂 二热轧单
        // "368238835416316": [0.50, 0.50],  // 梅山钢铁 冷轧厂
        // "368238835416317": [0.50, 0.50],  // 梅山钢铁 冷轧厂 1420冷轧单
        // "368238835416302": [0.50, 0.50],  // 梅山钢铁 电厂
        // "368238835416303": [0.50, 0.50],  // 梅山钢铁 电厂 电厂单
        // "368238835416322": [0.50, 0.50],  // 梅山钢铁 炼钢厂
        // "368238835416325": [0.50, 0.50],  // 梅山钢铁 炼钢厂 二炼钢单
        // "368238835416431": [0.50, 0.50],  // 梅山钢铁 运输部
        // "368238835416435": [0.50, 0.50],  // 梅山钢铁 运输部 铁路运输单元
        // "368238835416432": [0.50, 0.50],  // 梅山钢铁 运输部 码头单元

        // "426483584347386": [0.50, 0.50],  //  重庆钢铁 炼铁厂
        // "392402776970343": [0.50, 0.50],  //  重庆钢铁 炼铁厂 运转
        // "426483584347387": [0.50, 0.50],  //  重庆钢铁 炼铁厂 一烧结
        // "426483584347391": [0.50, 0.50],  //  重庆钢铁 炼铁厂 一高炉
        // "397907815575281": [0.50, 0.50],  //  重庆钢铁 炼铁厂 焦化
        // "426483584347393": [0.50, 0.50],  //  重庆钢铁 炼铁厂 三高炉
        // "426483584347390": [0.50, 0.50],  //  重庆钢铁 炼铁厂 烧结
        // "426483584347389": [0.50, 0.50],  //  重庆钢铁 炼铁厂 三烧结
        // "426483584347392": [0.50, 0.50],  //  重庆钢铁 炼铁厂 二高炉
        // "392402776970342": [0.50, 0.50],  //  重庆钢铁 炼铁厂 原加
        // "426483584347395": [0.50, 0.50],  //  重庆钢铁 炼铁厂 二烧结
        // "397907815575287": [0.50, 0.50],  //  重庆钢铁 炼铁厂 喷煤
        // "426483584347394": [0.50, 0.50],  //  重庆钢铁 炼铁厂 高炉
        // "426483584347615": [0.50, 0.50],  //  重庆钢铁 炼钢厂
        // "426483584496997": [0.50, 0.50],  //  重庆钢铁 炼钢厂 公辅
        // "426483584486020": [0.50, 0.50],  //  重庆钢铁 炼钢厂 一炼钢
        // "426483584347616": [0.50, 0.50],  //  重庆钢铁 轧钢厂
        // "390214213146514": [0.50, 0.50],  //  重庆钢铁 轧钢厂 厚板线
        // "390214213146516": [0.50, 0.50],  //  重庆钢铁 轧钢厂 中板线
        // "390214213146497": [0.50, 0.50],  //  重庆钢铁 轧钢厂 热卷产线
        // "426483584347617": [0.50, 0.50],  //  重庆钢铁 能环部
        // "390214213146520": [0.50, 0.50],  //  重庆钢铁 能环部 发电厂
        // "427064124041256": [0.50, 0.50],  //  重庆钢铁 能环部 风机
        // "427064124123455": [0.50, 0.50],  //  重庆钢铁 能环部 空压站
        // "427064124146028": [0.50, 0.50],  //  重庆钢铁 能环部 余热
        // "427064124143094": [0.50, 0.50],  //  重庆钢铁 能环部 煤气柜
        // "426483584347618": [0.50, 0.50],  //  重庆钢铁 物流运输部
        // "390214213620438": [0.50, 0.50],  //  重庆钢铁 物流运输部 料场作业区
        // "392402776910032": [0.50, 0.50],  //  重庆钢铁 物流运输部 铁路作业区
        // "392402776910034": [0.50, 0.50],  //  重庆钢铁 物流运输部 码头作业区

        // "377985141957623": [0.50, 0.50],  //  宝武清能 宝山气体
        // "377985142014732": [0.50, 0.50],  //  宝武清能 宝山气体 二区
        // "377985142014688": [0.50, 0.50],  //  宝武清能 宝山气体 一区
        // "377985141991619": [0.50, 0.50],  //  宝武清能 上海宝氢
        // "377985141991620": [0.50, 0.50],  //  宝武清能 上海宝氢 示例产线
        // "377985141991622": [0.50, 0.50],  //  宝武清能 宝锐特
        // "377985141991623": [0.50, 0.50],  //  宝武清能 宝锐特 示例产线1
        // "377985141991625": [0.50, 0.50],  //  宝武清能 鄂州气体
        // "377985141991626": [0.50, 0.50],  //  宝武清能 鄂州气体 制氧新区
        // "377985141991628": [0.50, 0.50],  //  宝武清能 湛江气体
        // "377985141991637": [0.50, 0.50],  //  宝武清能 湛江气体 二期
        // "377985141991629": [0.50, 0.50],  //  宝武清能 湛江气体 一期
        // "377985141991642": [0.50, 0.50],  //  宝武清能 武钢气体
        // "377985141991662": [0.50, 0.50],  //  宝武清能 武钢气体 空压站单元
        // "377985141991643": [0.50, 0.50],  //  宝武清能 武钢气体 制氧单元
        // "377985141991658": [0.50, 0.50],  //  宝武清能 武钢气体 特气单元
        // "377985141991664": [0.50, 0.50],  //  宝武清能 朝阳气体
        // "377985141991665": [0.50, 0.50],  //  宝武清能 朝阳气体 建桥基地
        // "377985141991667": [0.50, 0.50],  //  宝武清能 朝阳气体 长寿基地
      },
    }
  },
  computed: {
    InfoList() {
      return this.imgContainerLoaded ? [...this.subDomainList] : []
    },
    subImgStyle() {
      return function (info = {}) {
        if (this.h) {
          let [x0, y0, x1, y1] = this.h
          let co = (this.axisList || {})[info['DOMAIN_ID']]
          return co && this.h ? `position: absolute;left:${x0 + co[0] * x1}px;top:${y0 + co[1] * y1}px;` : 'width:200px; height:30px; display:flex;'
        }
      }
    },
    h() {
      let { offsetHeight, offsetWidth, imgH } = (document.getElementById('baseImg') && document.getElementById('baseImg')) || {}
      if (offsetHeight) {
        imgH = Math.min(offsetHeight, offsetWidth / 1.52)
      }
      let x0 = (offsetWidth - imgH * 1.52) / 2
      let y0 = (offsetHeight - imgH) / 2
      return offsetHeight ? [x0, y0, imgH * 1.52, imgH, this.$store.state.app.resizeFlagT] : null
    },
    domainNameClass() {
      if (this.$route.params.id == '408348049827378') return 'base-name darkName'
      return 'base-name'
    },
  },
  beforeMount() {
    let _this = this
    this.$nextTick(function () {
      _this.imgContainerLoaded = true
    })
  },

  mounted() {
    this.setBaseInfoFunc()
  },

  methods: {
    ...mapMutations('app', {
      setConfigNodeId: 'SET_CONFIG_NODE_ID',
      setConfigNodeLevel: 'SET_CONFIG_NODE_LEVEL',
      setLastClickStamp: 'SET_LAST_CLICK_STAMP',
      setLevel: 'SET_LEVEL',
      setNodeId: 'SET_NODE_ID',
      setDeviceCode: 'SET_DEVICE_CODE',
      setLevelList: 'SET_LEVEL_LIST',
      // setCurrentNode: 'SET_CURRENT_NODE',
      setNodeName: 'SET_NODE_NAME',
      setDomainPath: 'SET_DOMAIN_PATH',
    }),
    switchNode(nodeInfo) {
      // console.log('switchNode nodeInfo', nodeInfo)
      // if (
      //   nodeInfo.DOMAIN_LEVEL == 'base' ||
      //   nodeInfo.DOMAIN_LEVEL == 'factory' ||
      //   nodeInfo.DOMAIN_LEVEL == 'productLine' ||
      //   nodeInfo.DOMAIN_LEVEL == 'area'
      // ) {
      //   this.setConfigNodeLevel('domain')
      // } else {
      //   this.setConfigNodeLevel('device')
      // }
      this.setConfigNodeLevel(nodeInfo.DOMAIN_LEVEL)
      this.setLevel(nodeInfo.DOMAIN_LEVEL)
      // console.log('process.env.NODE_ENV', process.env.NODE_ENV)
      // if (process.env.NODE_ENV == 'test') {
      //   this.setConfigNodeId('610025608')
      // } else {
      //   this.setConfigNodeId(nodeInfo.DOMAIN_ID)
      // }
      this.setConfigNodeId(nodeInfo.DOMAIN_ID)
      this.setLastClickStamp(Date.now())
      // if (process.env.NODE_ENV == 'test') {
      //   setCurrentNodeId('610025608')
      // } else {
      //   setCurrentNodeId(nodeInfo.DOMAIN_ID)
      // }
      setCurrentNodeId(nodeInfo.DOMAIN_ID)
      // if (
      //   nodeInfo.DOMAIN_LEVEL == 'base' ||
      //   nodeInfo.DOMAIN_LEVEL == 'factory' ||
      //   nodeInfo.DOMAIN_LEVEL == 'productLine' ||
      //   nodeInfo.DOMAIN_LEVEL == 'area'
      // ) {
      //   setCurrentNodeLevel('domain')
      // } else {
      //   setCurrentNodeLevel('device')
      // }
      setCurrentNodeLevel(nodeInfo.DOMAIN_LEVEL)
      if (nodeInfo.DOMAIN_LEVEL == 'base' || nodeInfo.DOMAIN_LEVEL == 'factory' || nodeInfo.DOMAIN_LEVEL == 'productLine') {
        this.$router.push('/bigscreen/' + nodeInfo.DOMAIN_ID)
      } else {
        return
        // this.$router.push('/real/index/')
      }

      // if (process.env.NODE_ENV == 'test') {
      //   this.$router.push('/real/index/' + '610025608')
      // } else {
      //   this.$router.push('/real/index/' + nodeInfo.DOMAIN_ID)
      // }

      // if (nodeInfo.DOMAIN_LEVEL == 'factory') {
      //   this.$router.push('/bigscreen/' + nodeInfo.DOMAIN_ID)
      // } else if (nodeInfo.DOMAIN_LEVEL == 'domain') {
      //   this.setConfigNodeLevel('domain')
      //   this.setConfigNodeId(nodeInfo.DOMAIN_ID)
      //   this.setLastClickStamp(Date.now())
      //   setCurrentNodeId(nodeInfo.DOMAIN_ID)
      //   setCurrentNodeLevel('domain')
      //   this.$router.push('/real/index/' + nodeInfo.DOMAIN_ID)
      // }
    },
    // showBase(baseInfo) {
    //   let domainId = baseInfo['DOMAIN_ID']
    //   // if(baseInfo['DOMAIN_LEVEL'] == 'factory' && this.$allowFactoryIds.includes(domainId)){ // 从基地跳厂区
    //   if (baseInfo['DOMAIN_LEVEL'] == 'factory') {
    //     // 从基地跳厂区
    //     let baseId = baseInfo['DOMAIN_ID']
    //     this.$store.commit('setCurrentDomain', baseId)
    //     this.$router.push({ name: 'base', params: { id: baseId } })
    //   } else if (baseInfo['DOMAIN_LEVEL'] == 'prodLine' && this.$allowProdLineIds.includes(domainId)) {
    //     // }else if(baseInfo['DOMAIN_LEVEL'] == 'prodLine'){
    //     this.$store.commit('setCurrentFactoryId', domainId)
    //     this.$router.push({ name: 'prodLine', params: { id: domainId } })
    //   } else {
    //     this.$message('暂未开放！')
    //   }
    // },

    setBaseInfoFunc() {
      const nodeId = this.$route.params.nodeId
      if (!nodeId || nodeId == ':nodeId') return
      try {
        this.coverImgUrl = require(`./map/${nodeId}.png`)
      } catch (error) {
        this.coverImgUrl = null
      }
      if (this.coverImgUrl == null || this.coverImgUrl == undefined || this.coverImgUrl == '') {
        this.coverImgUrl = require(`./map/31428667306104.png`)
      }
      const params = {
        nodeId,
      }
      getNextLevelNodes(params).then((res) => {
        console.log('getNextLevelNodes', res)
        let tempArr = []
        for (let i of res.data.result) {
          let tempObj = {}
          tempObj.DOMAIN_ID = i.id
          tempObj.DOMAIN_NAME = i.name
          if (i.domainType == '基地') {
            tempObj.DOMAIN_LEVEL = 'base'
          } else if (i.domainType == '厂部') {
            tempObj.DOMAIN_LEVEL = 'factory'
          } else if (i.domainType == '产线') {
            tempObj.DOMAIN_LEVEL = 'productLine'
          } else if (i.domainType == '区域') {
            tempObj.DOMAIN_LEVEL = 'area'
          } else {
            tempObj.DOMAIN_LEVEL = 'device'
          }
          tempObj.DOMAINS = i.domainPath
          tempArr.push(tempObj)
        }
        this.subDomainList = tempArr
        if (this.subDomainList.length == 0) {
          // this.subDomainList = subDomainListData
        }
      })
    },
  },

  watch: {
    '$route.params': {
      handler: function () {
        this.subDomainList = []
        this.setBaseInfoFunc()
      },
      deep: true,
    },
  },
}
</script>

<style lang="scss">
#base-main-map-content {
  #baseImg {
    width: 100%;
    height: 150%;
    padding-top: 50px;
    background-repeat: no-repeat;
    background-size: contain;
    background-position: center;
    position: relative;
  }
  .itemsImg {
    width: 100%;
    height: 100%;
    display: flex;
    flex-direction: column;
    flex-wrap: wrap;
    padding-bottom: 10%;
  }
  .sub-base-img {
    width: 25px;
    height: 25px;
    background-image: url(./images/img_sign.png);
    //position: absolute;
    background-repeat: no-repeat;
    background-size: contain;
    background-position: center;
    position: relative;
    cursor: pointer;
  }
  .sub-base-img-container {
    position: relative;
    z-index: 11;
    .base-name {
      color: #00ffff;
    }

    .base-name.darkName {
      background-color: #3b3b3b60;
    }
  }
  .sub-base-img-container:hover {
    .sub-base-img {
      width: 30px;
      height: 30px;
      color: yellow;
    }
    .base-name {
      color: yellow;
      font-weight: 600;
    }
  }
}
</style>
